CalciCollection.postman_collection.json

{
	"info": {
		"_postman_id": "3fbb4414-805d-4cdc-b0b9-aa8e7d10f31d",
		"name": "CalciCollection",
		"schema": "https://schema.getpostman.com/json/collection/v2.1.0/collection.json",
		"_exporter_id": "23848780"
	},
	"item": [
		{
			"name": "Calci-Add",
			"event": [
				{
					"listen": "test",
					"script": {
						"exec": [
							"pm.test(\"Status code is Success\", function () {\r",
							"  //pm.response.to.have.status(201);)}\r",
							"  });"
						],
						"type": "text/javascript"
					}
				}
			],
			"protocolProfileBehavior": {
				"disabledSystemHeaders": {
					"content-type": true
				}
			},
			"request": {
				"method": "POST",
				"header": [
					{
						"key": "Content-Type",
						"value": "text/xml; charset=utf-8",
						"type": "text"
					},
					{
						"key": "Content-Length",
						"value": "length",
						"type": "text",
						"disabled": true
					}
				],
				"body": {
					"mode": "raw",
					"raw": "<?xml version=\"1.0\" encoding=\"utf-8\"?>\r\n<soap:Envelope xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\" xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">\r\n  <soap:Body>\r\n    <Add xmlns=\"http://tempuri.org/\">\r\n      <intA>10</intA>\r\n      <intB>20</intB>\r\n    </Add>\r\n  </soap:Body>\r\n</soap:Envelope>",
					"options": {
						"raw": {
							"language": "xml"
						}
					}
				},
				"url": {
					"raw": "http://www.dneonline.com/calculator.asmx",
					"protocol": "http",
					"host": [
						"www",
						"dneonline",
						"com"
					],
					"path": [
						"calculator.asmx"
					]
				}
			},
			"response": []
		},
		{
			"name": "Calci-Subtract",
			"event": [
				{
					"listen": "test",
					"script": {
						"exec": [
							"pm.test(\"Status code is Pass\", function () {\r",
							"  //pm.response.to.have.status(201);)}\r",
							"  });"
						],
						"type": "text/javascript"
					}
				}
			],
			"protocolProfileBehavior": {
				"disabledSystemHeaders": {
					"content-type": true
				}
			},
			"request": {
				"method": "POST",
				"header": [
					{
						"key": "Content-Type",
						"value": "text/xml; charset=utf-8",
						"type": "text"
					}
				],
				"body": {
					"mode": "raw",
					"raw": "<?xml version=\"1.0\" encoding=\"utf-8\"?>\r\n<soap:Envelope xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\" xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">\r\n  <soap:Body>\r\n    <Subtract xmlns=\"http://tempuri.org/\">\r\n      <intA>40</intA>\r\n      <intB>50</intB>\r\n    </Subtract>\r\n  </soap:Body>\r\n</soap:Envelope>",
					"options": {
						"raw": {
							"language": "xml"
						}
					}
				},
				"url": {
					"raw": "http://www.dneonline.com/calculator.asmx",
					"protocol": "http",
					"host": [
						"www",
						"dneonline",
						"com"
					],
					"path": [
						"calculator.asmx"
					]
				}
			},
			"response": []
		},
		{
			"name": "Calci-Multiply",
			"event": [
				{
					"listen": "test",
					"script": {
						"exec": [
							"pm.test(\"Status code is Pass\", function () {\r",
							"  //pm.response.to.have.status(201);)}\r",
							"  });"
						],
						"type": "text/javascript"
					}
				}
			],
			"protocolProfileBehavior": {
				"disabledSystemHeaders": {
					"content-type": true
				}
			},
			"request": {
				"method": "POST",
				"header": [
					{
						"key": "Content-Type",
						"value": "text/xml; charset=utf-8",
						"type": "text"
					}
				],
				"body": {
					"mode": "raw",
					"raw": "<?xml version=\"1.0\" encoding=\"utf-8\"?>\r\n<soap:Envelope xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\" xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">\r\n    <soap:Body>\r\n        <Multiply xmlns=\"http://tempuri.org/\">\r\n            <intA>100</intA>\r\n            <intB>50</intB>\r\n        </Multiply>\r\n    </soap:Body>\r\n</soap:Envelope>",
					"options": {
						"raw": {
							"language": "xml"
						}
					}
				},
				"url": {
					"raw": "http://www.dneonline.com/calculator.asmx",
					"protocol": "http",
					"host": [
						"www",
						"dneonline",
						"com"
					],
					"path": [
						"calculator.asmx"
					]
				}
			},
			"response": []
		},
		{
			"name": "calci-Divide",
			"event": [
				{
					"listen": "test",
					"script": {
						"exec": [
							"pm.test(\"Status code is Pass\", function () {\r",
							"  //pm.response.to.have.status(201);)}\r",
							"  });"
						],
						"type": "text/javascript"
					}
				}
			],
			"request": {
				"method": "POST",
				"header": [
					{
						"key": "Content-Type",
						"value": "text/xml; charset=utf-8",
						"type": "text"
					}
				],
				"body": {
					"mode": "raw",
					"raw": "<?xml version=\"1.0\" encoding=\"utf-8\"?>\r\n<soap:Envelope xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\" xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">\r\n  <soap:Body>\r\n    <Divide xmlns=\"http://tempuri.org/\">\r\n      <intA>int</intA>\r\n      <intB>int</intB>\r\n    </Divide>\r\n  </soap:Body>\r\n</soap:Envelope>"
				},
				"url": {
					"raw": "http://www.dneonline.com/calculator.asmx HTTP/1.1",
					"protocol": "http",
					"host": [
						"www",
						"dneonline",
						"com"
					],
					"path": [
						"calculator.asmx HTTP",
						"1.1"
					]
				}
			},
			"response": []
		}
	]
}